In [1]:
import pandas as pd
import numpy as np

In [2]:
# import sys
# sys.path.append('.../Jane')

import extract_data_ez
import transformers_ez

%load_ext autoreload
%autoreload 2

In [3]:
date_cut = '2015-01-01'

In [4]:
df_initial = extract_data_ez.zillow_data
air_df_initial = extract_data_ez.airqual_data
persinc_df_initial = extract_data_ez.persinc_data
inclvl_df_initial = extract_data_ez.inclvl_data
census_df_initial = extract_data_ez.census_data

In [5]:
inclvl_df_initial

          Date  Vol_moderate_income  Vol_low_income
0   2005-01-01         4.578106e+09    7.635135e+08
1   2005-02-01         4.563908e+09    7.558710e+08
2   2005-03-01         4.762458e+09    8.171551e+08
3   2005-04-01         4.744005e+09    7.854169e+08
4   2005-05-01         4.752915e+09    8.289172e+08
..         ...                  ...             ...
158 2018-03-01         4.476840e+09    8.935432e+08
159 2018-04-01         4.440339e+09    8.753101e+08
160 2018-05-01         4.571036e+09    8.904970e+08
161 2018-06-01         4.398129e+09    8.982546e+08
162 2018-07-01         4.220966e+09    8.639582e+08

[163 rows x 3 columns]

In [6]:
df = df_initial.copy()
air_df = air_df_initial.copy()
persinc_df = persinc_df_initial.copy()
inclvl_df = inclvl_df_initial.copy()
census_df = census_df_initial.copy()
nulls_df = df[df['Rent'].isnull()]

In [7]:
nulls_df

Empty DataFrame
Columns: [RegionID, Zipcode, City, State, Metro, County, SizeRank, Date, Rent, Year]
Index: []

In [8]:
df = df_initial.copy()
include_cities = ['Miami Beach','Miami','North Miami']
#df = df[df['City'].isin(include_cities)]
counties = ['Miami-Dade County', 'Broward County', 'Palm Beach County']
# counties = ['Alameda County', 'Contra Costa County', 'Marin County', 'Napa County', 'San Mateo County', 
#             'Santa Clara County', 'Solano County', 'Sonoma County', 'San Francisco County']
df = df[df['County'].isin(counties)]

In [9]:
df.head()

,RegionID,Zipcode,City,State,Metro,County,SizeRank,Date,Rent,Year
96843,72463,33160,Sunny Isles Beach,FL,Miami-Fort Lauderdale-West Palm Beach,Miami-Dade County,72,2015-01-01,1963.0,2015
96857,72363,33025,Miramar,FL,Miami-Fort Lauderdale-West Palm Beach,Broward County,86,2015-01-01,1393.0,2015
96862,72442,33139,Miami Beach,FL,Miami-Fort Lauderdale-West Palm Beach,Miami-Dade County,91,2015-01-01,2009.0,2015
96899,72362,33024,Pembroke Pines,FL,Miami-Fort Lauderdale-West Palm Beach,Broward County,128,2015-01-01,1295.0,2015
96932,72347,33009,Hallandale,FL,Miami-Fort Lauderdale-West Palm Beach,Broward County,161,2015-01-01,1524.0,2015

In [10]:
air_df.head()

     State            County        City    AQIMean       Date
0  Alabama  Jefferson County  Birmingham  12.065635 2013-12-01
1  Alabama  Jefferson County  Birmingham  12.899658 2014-01-01
2  Alabama  Jefferson County  Birmingham   8.851034 2014-02-01
3  Alabama  Jefferson County  Birmingham  13.212881 2014-03-01
4  Alabama  Jefferson County  Birmingham  11.379411 2014-04-01

In [11]:
air_df['County'].unique()

array(['Jefferson County', 'Fairbanks North Star  County',
       'La Paz County', 'Maricopa County', 'Pima County',
       'Crittenden County', 'Pulaski County', 'Alameda County',
       'Butte County', 'Contra Costa County', 'Fresno County',
       'Humboldt County', 'Imperial County', 'Kern County',
       'Kings County', 'Los Angeles County', 'Madera County',
       'Marin County', 'Merced County', 'Monterey County', 'Napa County',
       'Nevada County', 'Orange County', 'Placer County',
       'Riverside County', 'Sacramento County', 'San Bernardino County',
       'San Diego County', 'San Francisco County', 'San Joaquin County',
       'San Luis Obispo County', 'San Mateo County',
       'Santa Barbara County', 'Santa Clara County', 'Santa Cruz County',
       'Solano County', 'Sonoma County', 'Stanislaus County',
       'Sutter County', 'Tulare County', 'Ventura County', 'Yolo County',
       'Adams County', 'Archuleta County', 'Delta County',
       'Denver County', 'Garfield County', 'Jackson County',
       'La Plata County', 'Park County', 'Rio Blanco County',
       'Weld County', 'Fairfield County', 'Hartford County',
       'Litchfield County', 'New Haven County',
       'BAJA CALIFORNIA NORTE County', 'New Castle County',
       'Sussex County', 'District of Columbia County', 'Broward County',
       'Duval County', 'Escambia County', 'Hillsborough County',
       'Miami-Dade County', 'Palm Beach County', 'Pinellas County',
       'Sarasota County', 'DeKalb County', 'Fulton County',
       'Paulding County', 'Rockdale County', 'Honolulu County',
       'Kauai County', 'Ada County', 'Kootenai County', 'Cook County',
       'Macoupin County', 'Saint Clair County', 'Bartholomew County',
       'Lake County', 'Marion County', 'St. Joseph County',
       'Vanderburgh County', 'Whitley County', 'Polk County',
       'Scott County', 'Van Buren County', 'Linn County', 'Neosho County',
       'Sedgwick County', 'Sumner County', 'Trego County',
       'Wyandotte County', 'Boyd County', 'Campbell County',
       'Daviess County', 'Fayette County', 'McCracken County',
       'Ascension County', 'Calcasieu County', 'East Baton Rouge County',
       'Iberville County', 'Livingston County', 'Orleans County',
       'West Baton Rouge County', 'Aroostook County', 'Cumberland County',
       'Kennebec County', 'Baltimore County', 'Baltimore (City) County',
       'Garrett County', 'Howard County', "Prince George's County",
       'Essex County', 'Hampden County', 'Hampshire County',
       'Middlesex County', 'Norfolk County', 'Suffolk County',
       'Worcester County', 'Ingham County', 'Missaukee County',
       'Ottawa County', 'Wayne County', 'Anoka County', 'Carlton County',
       'Dakota County', 'Hennepin County', 'Saint Louis County',
       'Hinds County', 'Clay County', 'Greene County', 'Monroe County',
       'Saint Charles County', 'Sainte Genevieve County',
       'St. Louis City County', 'Fergus County', 'Gallatin County',
       'Phillips County', 'Powder River County', 'Richland County',
       'Rosebud County', 'Clark County', 'Washoe County',
       'Rockingham County', 'Bergen County', 'Camden County',
       'Hudson County', 'Mercer County', 'Morris County', 'Union County',
       'Warren County', 'Bernalillo County', 'Dona Ana County',
       'Eddy County', 'Lea County', 'Luna County', 'San Juan County',
       'Bronx County', 'Erie County', 'Franklin County', 'Nassau County',
       'Queens County', 'Steuben County', 'Forsyth County', 'Lee County',
       'Mecklenburg County', 'Northampton County', 'Wake County',
       'Burke County', 'Burleigh County', 'Cass County', 'Dunn County',
       'McKenzie County', 'Oliver County', 'Ward County', 'Athens County',
       'Belmont County', 'Cuyahoga County', 'Hamilton County',
       'Medina County', 'Adair County', 'Canadian County', 'Grady County',
       'Oklahoma County', 'Sequoyah County', 'Tulsa County',
       'Multnomah County', 'Washington County', 'Allegheny County',
       'Beaver County', 'Berks County', 'Bradford County', 'Bucks County',
       'Cambria County', 'Centre County', 'Dauphin County',
       'Delaware County', 'Lackawanna County', 'Lancaster County',
       'Perry County', 'Philadelphia County', 'Tioga County',
       'York County', 'Caguas County', 'Catano County', 'Guaynabo County',
       'Kent County', 'Providence County', 'Charleston County',
       'Greenville County', 'Custer County', 'Minnehaha County',
       'Pennington County', 'Blount County', 'Bradley County',
       'Davidson County', 'McMinn County', 'Montgomery County',
       'Shelby County', 'Sullivan County', 'Bell County', 'Bexar County',
       'Brazoria County', 'Dallas County', 'Denton County',
       'El Paso County', 'Ellis County', 'Galveston County',
       'Gregg County', 'Harris County', 'Harrison County', 'Hays County',
       'Hunt County', 'Karnes County', 'Kaufman County',
       'McLennan County', 'Navarro County', 'Parker County',
       'Smith County', 'Tarrant County', 'Travis County', 'Wilson County',
       'Box Elder County', 'Cache County', 'Carbon County',
       'Davis County', 'Duchesne County', 'Iron County',
       'Salt Lake County', 'Tooele County', 'Uintah County',
       'Utah County', 'Weber County', 'Chittenden County',
       'Rutland County', 'Alexandria City County', 'Arlington County',
       'Caroline County', 'Charles County', 'Fairfax County',
       'Hampton City County', 'Henrico County', 'Loudoun County',
       'Newport News City County', 'Norfolk City County',
       'Prince William County', 'Richmond City County', 'Roanoke County',
       'Grant County', 'King County', 'Pierce County', 'Skagit County',
       'Forest County', 'Kenosha County', 'Manitowoc County',
       'Milwaukee County', 'Albany County', 'Big Horn County',
       'Converse County', 'Fremont County', 'Goshen County',
       'Johnson County', 'Laramie County', 'Natrona County',
       'Sheridan County', 'Sublette County', 'Sweetwater County',
       'Teton County', 'Uinta County', 'Weston County'], dtype=object)

In [12]:
df['County'].unique()

array(['Miami-Dade County', 'Broward County', 'Palm Beach County'],
      dtype=object)

In [13]:
air_df = air_df[air_df['County'].isin(counties)]
print(air_df['AQIMean'].min())
print(air_df['AQIMean'].max())

1.360337258064516
18.821107428571423

In [14]:
#air_df
min_df = air_df[['AQIMean','County','Date']].groupby(['County','Date']).min().reset_index()
min_df = min_df.rename(columns={'AQIMean':'min'})
max_df = air_df[['AQIMean','County','Date']].groupby(['County','Date']).max().reset_index()
max_df = max_df.rename(columns={'AQIMean':'max'})
grouped = pd.merge(min_df,max_df,on=['County','Date'],how='inner')

In [15]:
grouped.to_csv('min_max_comp.csv')

In [16]:
df['State'].unique()

array(['FL'], dtype=object)

In [17]:
persinc_df.head()

  State  Year  PersonalIncome
0    TX  2008           44521
1    FL  2008           44447
2    NY  2008           48585
3    CA  2008           54862
4    TX  2009           42103

In [18]:
census_df.head()

,geo_id,do_date,total_pop,households,male_pop,female_pop,median_age,male_under_5,male_5_to_9,male_10_to_14,...,sales_office_employed,in_grades_1_to_4,in_grades_5_to_8,in_grades_9_to_12,in_school,in_undergrad_college,speak_only_english_at_home,speak_spanish_at_home,speak_spanish_at_home_low_english,Zipcode
0,87537,2014-01-01,2510,856,1283,1227,42.1,58,75,87,...,NaN,304,171,80,593,20,NaN,NaN,NaN,87537
1,87017,2014-01-01,346,112,150,196,50.9,0,0,12,...,NaN,0,27,15,96,40,NaN,NaN,NaN,87017
2,87528,2014-01-01,3505,727,1758,1747,27.9,260,194,159,...,NaN,293,266,298,1237,138,NaN,NaN,NaN,87528
3,87533,2014-01-01,133,58,49,84,25.8,0,12,8,...,NaN,24,8,7,58,3,NaN,NaN,NaN,87533
4,87511,2014-01-01,2896,787,1177,1719,36.0,142,63,44,...,NaN,263,107,163,1008,279,NaN,NaN,NaN,87511

In [19]:
    #inclvl_moderate = dataframe[dataframe.IncomeLevelGroup == 'Moderate'][['Date','Vol']]
    #inclvl_moderate = inclvl_moderate.rename(columns={'Vol':'Vol_moderate_income'})
    #inclvl_low = dataframe[dataframe.IncomeLevelGroup == 'Low'][['Date','Vol']]
    #inclvl_low = inclvl_low.rename(columns={'Vol':'Vol_low_income'})
    #dataframe = pd.merge(inclvl_moderate,inclvl_low,on='Date')

In [20]:
merged_df = transformers_ez.join_dfs(df,air_df,persinc_df,inclvl_df,census_df)

3660
3660
3660
3660
3660
3660

In [21]:
len(merged_df)

3660

In [22]:
len(df)

3660

In [24]:
for i in merged_df.columns:
    if 'income' in i:
        print(i)

Vol_moderate_income
Vol_low_income
median_income
income_per_capita
income_less_10000
income_10000_14999
income_15000_19999
income_20000_24999
income_25000_29999
income_30000_34999
income_35000_39999
income_40000_44999
income_45000_49999
income_50000_59999
income_60000_74999
income_75000_99999
income_100000_124999
income_125000_149999
income_150000_199999
income_200000_or_more
percent_income_spent_on_rent

In [25]:
merged_df['Vol_low_income']

0       7.265682e+08
1       7.265682e+08
2       7.265682e+08
3       7.265682e+08
4       7.265682e+08
            ...
3655             NaN
3656             NaN
3657             NaN
3658             NaN
3659             NaN
Name: Vol_low_income, Length: 3660, dtype: float64